Revit 2027 API
LoadedFamilyIntegrityCheck.CheckAllFamiliesSlow Method
 Check integrity of content documents of all families loaded in the host document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckAllFamiliesSlow(
	Document ADoc,
	ISet<ElementId> corruptFamilyIds
)
Public Shared Function CheckAllFamiliesSlow (
	ADoc As Document,
	corruptFamilyIds As ISet(Of ElementId)
) As Boolean
public:
static bool CheckAllFamiliesSlow(
	Document^ ADoc,
	ISet<ElementId^>^ corruptFamilyIds
)
static member CheckAllFamiliesSlow :
        ADoc : Document *
        corruptFamilyIds : ISet<ElementId> -> bool
Parameters
ADoc Document
 The host document.
corruptFamilyIds ISet<ElementId>
 Return ids of families that need to be reloaded because their content documents are missing or corrupt.
Return Value
Boolean
 Returns true if all content documents are usable.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This check is slow as it invloves traversal of all content documents. It also dumps data about bad families into the journal, as well as the whole content tree into the dump file.
See Also
Reference
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace